Revit 2027 API
SpacingRule.SetLayoutFixedNumber Method
Set the Layout property to FixedNumber.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutFixedNumber(
	int number,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
Public Sub SetLayoutFixedNumber (
	number As Integer,
	just As SpacingRuleJustification,
	gridlinesRotation As Double,
	offset As Double
)
public:
void SetLayoutFixedNumber(
	int number,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
member SetLayoutFixedNumber :
        number : int *
        just : SpacingRuleJustification *
        gridlinesRotation : float *
        offset : float -> unit
Parameters
number Int32
just SpacingRuleJustification
gridlinesRotation Double
offset Double
Remarks
When changing the Layout to FixedNumber, you must also simultaneously set the Number, Justification, GridlinesRotation, and Offset properties.
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace